/* Якщо змінна a строго більша за нуль і менше-рівно 5-ти, то виведіть 'Вірно',
інакше виведіть 'Невірно'. Перевірте роботу скрипта при a, що дорівнює 5, 0, -3, 2. */

function test1(a) {
    if (a > 0 && a <= 5) {
        console.log("Вірно")
    } else {
        console.log("Невірно")
    }
}

test1(5);
test1(0)
test1(-3);
test1(2);

/* Якщо змінна a дорівнює нулю або дорівнює двом, додайте до неї 7,
інакше поділіть її на 10. Виведіть нове значення змінної на екран.
Перевірте роботу скрипта при a, що дорівнює 5, 0, -3, 2. */

function test2(a) {
    if (a === 0 || a === 2) {
        a += 7;
    } else {
        a /= 7;
    }

    console.log(a);
}

test2(5);
test2(0)
test2(-3);
test2(2);

/* Чому код поводиться таким чином? */

const isBig = (thing) => {
    if (thing == 0 || thing == 1 || thing == 2) {
        return false;
    }
    return true;
};
isBig(1); // false, в даному випадку задовольняється умова 1 == 1
isBig([2]); // false, задовільняється умова [2] == 2, бо число у масиві приводиться до звичайного числа
isBig([3]); // true, 3 не дорівнює 0, 1 і 2
